<?php
class Knowledge extends ORM {

    var $table = 'knowledges';
	
	var $has_one = array('user','category');
	
	var $has_many = array('knowledge_file');
	
    function __construct($id = NULL)
    {
        parent::__construct($id);
    }
	
	function label()
	{
		return array_merge(array(
'ก' => "ก", 'ข' => "ข", 'ฃ' => "ฃ", 'ค' => "ค", 'ฅ' => "ฅ", 'ฆ' => "ฆ", 'ง' => "ง",
'จ' => "จ", 'ฉ' => "ฉ", 'ช' => "ช", 'ซ' => "ซ", 'ฌ' => "ฌ", 'ญ' => "ญ", 'ฎ' => "ฎ",
'ฏ' => "ฏ", 'ฐ' => "ฐ", 'ฑ' => "ฑ", 'ฒ' => "ฒ", 'ณ' => "ณ", 'ด' => "ด", 'ต' => "ต",
'ถ' => "ถ", 'ท' => "ท", 'ธ' => "ธ", 'น' => "น", 'บ' => "บ", 'ป' => "ป", 'ผ' => "ผ",
'ฝ' => "ฝ", 'พ' => "พ", 'ฟ' => "ฟ", 'ภ' => "ภ", 'ม' => "ม", 'ย' => "ย", 'ร' => "ร",
'ฤ' => "ฤ", 'ล' => "ล", 'ฦ' => "ฦ", 'ว' => "ว", 'ศ' => "ศ", 'ษ' => "ษ", 'ส' => "ส",
'ห' => "ห", 'ฬ' => "ฬ", 'อ' => "อ", 'ฮ' => "ฮ"),array_combine(range('a', 'z'), range('a', 'z')));
	}
}
?>