<?php
	//เขื่อมต่อกับ db และ query config ออกมา
	include "inc/connect.php";
	$sql = "SELECT * FROM chats WHERE id = 1";
	$query = mysql_query($sql); //query
	if ($query) {
		while($r = mysql_fetch_array($query)){
			$user_chat = $r['member_chat'];
			$forbidden = $r['forbidden'];
			$rooms = $r['rooms'];
			$linecount = $r['linecount'];
			$logdate = $r['logdate'];
			$show_lastmsg = $r['showlastmsg'];
		}
	}
?>
<?php
	// ไฟล์ค่ากำหนดของระบบ
	// กำหนดให้ตรงกับ config ของเว็บหลัก
	$prefix = 'poo';
	
	
	// ภาษา ใช้ TIS-620 สำหรับเว็บไซต์ที่ไม่รองรับ UTF-8
	// ถ้าเปลี่ยนเป็น TIS-620 ให้ save config.php และ language/th.lng ให้เป็น Ansi
	// ถ้าเปลี่ยนเป็น UTF-8 ให้ save config.php และ language/th.lng ให้เป็น UTF-8
	$charset = 'UTF-8';
	
	
	// ภาษาที่ติดตั้ง
	$language["th"] = "ไทย";
	$language["eng"] = "English";
	
	
	// กำหนดว่า ต้องมีระบบสมาชิกหรือไม่
	// 2 เข้าได้ทั้ง member และ guest
	// 1 member เท่านั้น
	// 0 guest เท่านั้น
	// ถ้ากำหนดให้เป็น member ต้องเขียนโค้ดตรวจสอบสมาชิกเพิ่มเติม ที่หน้า index.php
	//$user_chat = 0;
	
	
	// ชื่อสงวน ที่ห้ามใช้บน chat ไม่ต้องมีช่องว่างระหว่างคำ
	//$forbidden = "admin,webmaster,เว็บมาสเตอร์,เว็บมาสซะเตอร์,ผู้ดูแลระบบ,เวปมาสเตอร์,เวปมาสซะเตอร์";


	// ไดเร็คทอรี่เก็บข้อมูล ต้องมี / ต่อท้าย
	$datadir = "data/";
	
	
	// ชื่อห้อง
	//$rooms = array("ห้องรวม", "การควบคุมโรค", "ปรึกษาปัญหา");
	$rooms = explode(',', $rooms);
	
	
	// เวลาสำหรับอัปเดทการแสดงผล (msec)
	$msgtime = 4000;
	
	
	// เวลาสำหรับการอัปเดทรายการ user (msec)
	$usertime = 6000;
	
	
	// เวลาที่บอกว่า user logout (msec)
	// ค่านี้ถ้าน้อยไป อาจทำให้ user หลุดบ่อยได้
	// (ขึ้นอยู่กับปริมาณ user บนระบบ และ ความเร็วในการประมวลผลของระบบ)
	$disconnectuser = 30000;
	
	
	// ขนาดไอคอนที่แสดงในรายชื่อ user online
	$iconwidth = 30;
	
	
	// ความกว้างของรูปที่แสดง (BBCode)
	$imagewidth = 200;
	
	
	// จำนวนบรรทัดที่ต้องการแสดง
	//$linecount = 20;
	
	
	// เก็บ log ไว้กี่วัน 0 คือไม่เก็บ
	// จะลบข้อมูลทั้งหมดตอนเที่ยงคืน
	//$logdate = 0;
	
	
	// path ของ smile  icon เช่น skin/img/
	$smilepath = "skin/img/";
	
	
	// smile icon
	$smile = array(":0:", ":1:", ":2:", ":3:", ":4:", ":5:", ":6:", ":7:", ":8:", ":9:", ":10:", ":11:", ":12:", ":13:", ":14:", ":15:", ":16:", ":17:", ":18:", ":19:", ":20:", ":21:", ":22:", ":23:", ":24:", ":25:", ":26:", ":27:", ":28:", ":29:", ":30:", ":31:", ":32:", ":33:", ":34:", ":35:", ":36:", ":37:", ":38:", ":39:", ":40:", ":41:", ":42:", ":43:", ":44:", ":45:", ":46:", ":47:", ":48:", ":49:",
		":50:", ":51:", ":52:", ":53:", ":54:", ":55:", ":56:", ":57:", ":58:", ":59:", ":60:", ":61:", ":62:", ":63:", ":64:", ":65:", ":66:", ":67:", ":68:", ":69:", ":70:", ":71:", ":72:", ":73:", ":74:", ":75:", ":76:", ":77:", ":78:", ":79:", ":80:", ":81:", ":82:", ":83:", ":84:", ":85:", ":86:", ":87:", ":88:", ":89:", ":90:", ":91:", ":92:", ":93:", ":94:", ":95:", ":96:", ":97:", ":98:", ":99:", ":100:",
		":101:", ":102:", ":103:", ":104:", ":105:", ":106:", ":107:", ":108:", ":109:", ":110:", ":111:", ":112:", ":113:", ":114:", ":115:", ":116:", ":117:", ":118:", ":119:");
	$smileicon = array("0.gif", "1.gif", "2.gif", "3.gif", "4.gif", "5.gif", "6.gif", "7.gif", "8.gif", "9.gif", "10.gif", "11.gif", "12.gif", "13.gif", "14.gif", "15.gif", "16.gif", "17.gif", "18.gif", "19.gif", "20.gif", "21.gif", "22.gif", "23.gif", "24.gif", "25.gif", "26.gif", "27.gif", "28.gif", "29.gif", "30.gif", "31.gif", "32.gif", "33.gif", "34.gif", "35.gif", "36.gif", "37.gif", "38.gif", "39.gif",
		"40.gif", "41.gif", "42.gif", "43.gif", "44.gif", "45.gif", "46.gif", "47.gif", "48.gif", "49.gif", "50.gif", "51.gif", "52.gif", "53.gif", "54.gif", "55.gif", "56.gif", "57.gif", "58.gif", "59.gif", "60.gif", "61.gif", "62.gif", "63.gif", "64.gif", "65.gif", "66.gif", "67.gif", "68.gif", "69.gif", "70.gif", "71.gif", "72.gif", "73.gif", "74.gif", "75.gif", "76.gif", "77.gif", "78.gif", "79.gif", "80.gif",
		"81.gif", "82.gif", "83.gif", "84.gif", "85.gif", "86.gif", "87.gif", "88.gif", "89.gif", "90.gif", "91.gif", "92.gif", "93.gif", "94.gif", "95.gif", "96.gif", "97.gif", "98.gif", "99.gif", "100.gif", "101.gif", "102.gif", "103.gif", "104.gif", "105.gif", "106.gif", "107.gif", "108.gif", "109.gif", "110.gif", "111.gif", "112.gif", "113.gif", "114.gif", "115.gif", "116.gif", "117.gif", "118.gif", "119.gif");
		
		
	// รูป icon ของ user
	$icon = array("u0.gif", "u1.gif", "u2.gif", "u3.gif", "u4.gif", "u5.gif", "u6.gif", "u7.gif", "u8.gif", "u9.gif", "u10.gif", "u11.gif");
	
	
	// ปรับให้ตรงตามต้องการ เช่น เป็นค่าบวก หรือค่าลบ เพื่อให้เวลาของ server ตรงกับเวลาจริง
	$hour = - 1; 
	
	
	// กำหนดการแสดงผลในครั้งแรก ว่าให้แสดงข้อความเก่าหรือไม่
	// 1 แสดงข้อความล่าสุด, 0 แสดงเฉพาะข้อความต้อนรับ
	//$show_lastmsg = 0;
?>